[
    {
      "name": "Alex Hales",
      "address": "123 Main St",
      "review": "Melody Lab has been a game-changer for my guitar journey! The instructors are not only talented musicians but also patient and encouraging teachers. They break down complex concepts into manageable steps, making learning enjoyable and rewarding. I've made significant progress in a short time, and I owe it all to Melody Lab!",
      "batch": "Guitar Batch A",
      "rating":4.5
    },
    {
      "name": "Lily Turner",
      "address": "456 Elm St",
      "review": "I can't express how grateful I am to be a part of Melody Lab! Learning piano here has been an incredible experience. The teachers are skilled, supportive, and truly passionate about music. They create a nurturing environment where I feel comfortable pushing my limits and exploring my creativity. Melody Lab is the place to be for anyone who wants to learn piano!",
      "batch": "Piano Batch B",
      "rating":4.1

    },
    {
      "name": "Ryan Giggs",
      "address": "789 Oak St",
      "review": "Melody Lab rocks! The drum lessons here are both educational and fun. The instructors have a wealth of knowledge and know exactly how to keep the rhythm flowing. They provide a perfect balance of technique, theory, and practical application. Thanks to Melody Lab, I'm drumming to my heart's content!",
      "batch": "Drum Batch C",
      "rating":4
    },
    {
      "name": "Sophia Waheb",
      "address": "321 Maple St",
      "review": "Melody Lab has helped me discover the beauty of the violin. The teachers here are not only experts in their craft but also exceptional mentors. They have a knack for breaking down complex violin techniques and instilling a sense of discipline and passion. I feel lucky to have found Melody Lab and highly recommend it to anyone interested in learning the violin!",
      "batch": "Violin Batch A",
      "rating":5
    },
    {
      "name": "Max Bennington",
      "address": "654 Pine St",
      "review": "Melody Lab has been my secret weapon for improving my singing skills. The voice instructors here are phenomenal. They provide personalized vocal exercises, tips, and constructive feedback that have helped me strengthen my voice and increase my range. I'm so grateful for the supportive and inspiring environment Melody Lab offers!",
      "batch": "Voice Batch B",
      "rating":4.7
    }
  ]
  